<a href="https://colab.research.google.com/github/yoo-minho/colab/blob/main/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
os.listdir('./drive/MyDrive/machine_learning_data')

In [3]:
import os
import pandas as pd

In [5]:
# 데이터 폴더 src 변수 할당
base_src = './drive/MyDrive/machine_learning_data'

# friend.csv 파일 src 변수 할당
friend_src = base_src + '/friend.csv'

In [6]:
# pandas의 read_csv => 데이터 불러오기
df = pd.read_csv(friend_src, encoding='utf-8')

In [7]:
# head() 데이터를 읽어보기 => 디폴트로 5개 정도만 읽기
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [8]:
new_friend_src = base_src + "/new_friend.csv"

In [9]:
# index=False 필수 (인덱스 열 하나를 임의로 생성함)
df.to_csv(new_friend_src, index=False,  encoding='utf-8')

In [10]:
os.listdir(base_src)

['friend.csv', '.ipynb_checkpoints', 'new_friend.csv']

In [11]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [12]:
# Series 실습
import numpy as np

np.array([1,2,3])

array([1, 2, 3])

In [13]:
# 데이터프레임(집합) => 시리즈(단일)
series = df['name']
series

0     John
1    Jenny
2     Nate
3    Julia
4    Brian
5    Chris
Name: name, dtype: object

In [14]:
# pd.Series 함수를 통해서 만드는 것도 가능
series = pd.Series([1,2,3,4])
series

0    1
1    2
2    3
3    4
dtype: int64

In [15]:
# pd.Series 의 옵션이 무엇이 있는지 확인
# index => 할당 값의 지정 이름, 중복 가능
# dtype => 대표적 : int, float, string, boolean 등
series = pd.Series([1,2,3,4], index=['a','b','c','d'],dtype=float)
series

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [16]:
# sort_values 할 일이 많음
series = pd.Series([10,2,4,5], index=['a','b','c','d'],dtype=float)
series.sort_values(ascending=True)

b     2.0
c     4.0
d     5.0
a    10.0
dtype: float64

In [17]:
# 판다스의 봉우리 : DataFrame 실습
friend_df = pd.DataFrame({
    'a':[2,3],
    'b':[5,10]
}, columns=['a', 'b']) 
friend_df

   a   b
0  2   5
1  3  10

In [18]:
new_df = pd.DataFrame([[2,3],[5,10]],columns=['a','b'])
new_df

   a   b
0  2   3
1  5  10

In [22]:
# DataFrame 행, 열 선택및 필터링
df = pd.read_csv(friend_src, encoding='utf-8')
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [26]:
# index 2번에 해당하는 row 가져오기
df.iloc[4]

name      Brian
age          45
job     manager
Name: 4, dtype: object

In [30]:
df.iloc[[2,4]] # select * from friend where pk == 2;  숫자 검색

    name  age      job
2   Nate   30  teacher
4  Brian   45  manager

In [34]:
df['job']

0      student
1    developer
2      teacher
3      dentist
4      manager
5       intern
Name: job, dtype: object

In [41]:
df.loc[1:2,'job'] 
# iloc 인덱스 숫자검색
# loc 데이터프레임에 있는 그대로 검색 iloc vs loc 중요!!!!!
# : 전체라는 의미
# :2 2번 전까지 가져온다는 의미

1    developer
2      teacher
Name: job, dtype: object